<a href="https://colab.research.google.com/github/JonZmei/-project_01/blob/%D0%92%D1%81%D0%B5-%D0%B7%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D1%8F-%D0%B8-%D1%84%D0%B0%D0%B9%D0%BB%D1%8B/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Для создания таблицы Students в базе данных teacher с заданными полями можно воспользоваться следующим SQL-запросом:

CREATE TABLE Students (
    Student_Id INTEGER,
    Student_Name TEXT,
    School_Id INTEGER PRIMARY KEY
);
#Для наполнения таблицы данными можно использовать следующий SQL-запрос:
INSERT INTO Students (Student_Id, Student_Name, School_Id) VALUES 
(201, 'Иван', 1),
(202, 'Петр', 2),
(203, 'Анастасия', 3),
(204, 'Игорь', 4);

#Чтобы получить информацию о студенте и его школе по заданному ID студента, можно использовать следующий SQL-запро
SELECT s.Student_Id, s.Student_Name, s.School_Id, sc.School_Name
FROM Students s
JOIN Schools sc ON s.School_Id = sc.School_Id
WHERE s.Student_Id = <заданный ID студента>;
#В этом запросе мы выбираем из таблицы Students поля Student_Id, Student_Name и School_Id, а также из таблицы Schools поле School_Name. Затем мы соединяем таблицы Students и Schools по полю School_Id, чтобы получить название школы, и ограничиваем результаты только теми, где значение Student_Id равно заданному ID студента.

#К<заданный ID студента>, зависит от конкретной ситуации. Например, если мы хотим получить информацию о студенте с ID 202, то запрос будет выглядеть следующим образом:
SELECT s.Student_Id, s.Student_Name, s.School_Id, sc.School_Name
FROM Students s
JOIN Schools sc ON s.School_Id = sc.School_Id
WHERE s.Student_Id = 202;

#Аналогично, чтобы получить информацию о студенте с другим ID, нужно просто подставить нужное значение вместо 202 в выражении s.Student_Id = 202.

SyntaxError: ignored